; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v12 ?v2)
             (pred_6 ?v3 ?v13)
             (pred_3 ?v12 ?v13)
             (pred_8 ?v8 ?v12 )
	     (pred_4 ?v12)
             (pred_11 ?v6)
             (pred_10 ?v3)
             (pred_5 ?v13)
             (pred_9 ?v12)
             (pred_12 ?v3)
             (pred_7 ?v12)
             (pred_1 ))



(:action op_2
:parameters (?v9 ?v11 ?v7 ?v4)
:precondition (and (pred_11 ?v9) (pred_11 ?v11) (pred_10 ?v7) (pred_5 ?v4)
          (pred_2 ?v9 ?v11) (pred_6 ?v7 ?v4)
                   (pred_3 ?v11 ?v4) (pred_4 ?v9) 
                   (pred_9 ?v11) (pred_12 ?v7))
:effect (and  (pred_7 ?v11) (not (pred_9 ?v11))))


(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_11 ?v9) (pred_11 ?v10)
               (pred_4 ?v9) (pred_2 ?v9 ?v10) (pred_7 ?v10))
:effect (and (pred_4 ?v10) (not (pred_4 ?v9))))

(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_11 ?v9) (pred_10 ?v7) 
                  (pred_4 ?v9) (pred_8 ?v7 ?v9) (pred_1 ))
:effect (and (pred_12 ?v7)
   (not (pred_8 ?v7 ?v9)) (not (pred_1 ))))


(:action op_4
:parameters (?v9 ?v5 ?v1)
:precondition (and (pred_11 ?v9) (pred_10 ?v5) (pred_10 ?v1)
                  (pred_4 ?v9) (pred_12 ?v1) (pred_8 ?v5 ?v9))
:effect (and (pred_12 ?v5) (pred_8 ?v1 ?v9)
        (not (pred_12 ?v1)) (not (pred_8 ?v5 ?v9))))

(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_11 ?v9) (pred_10 ?v7) 
                  (pred_4 ?v9) (pred_12 ?v7))
:effect (and (pred_1 ) (pred_8 ?v7 ?v9) (not (pred_12 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_10 obj_02 obj_14 obj_08 obj_18 obj_12 obj_04 obj_01 obj_19 obj_06 obj_20 obj_13 obj_15 obj_16 obj_17
    obj_09 obj_07
    obj_11 obj_03 obj_05
    )

    (:init
       (pred_1)

       (pred_11 obj_21)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_14)
       (pred_11 obj_08)
       (pred_11 obj_18)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_11 obj_06)
       (pred_11 obj_20)
       (pred_11 obj_13)
       (pred_11 obj_15)
       (pred_11 obj_16)
       (pred_11 obj_17)
       (pred_5 obj_09)
       (pred_5 obj_07)
       (pred_10 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_05)

       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_10)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_21)
       (pred_2 obj_02 obj_12)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_12 obj_02)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_19 obj_15)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_20)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_06)
       (pred_2 obj_13 obj_15)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_15 obj_19)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_15)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_16)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_3  obj_13 obj_09)
       (pred_3  obj_08 obj_07)
       (pred_3  obj_18 obj_07)
       (pred_7 obj_21)
       (pred_7 obj_10)
       (pred_7 obj_02)
       (pred_7 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_19)
       (pred_7 obj_06)
       (pred_7 obj_20)
       (pred_7 obj_15)
       (pred_7 obj_16)
       (pred_7 obj_17)

       (pred_6  obj_11 obj_09)
       (pred_6  obj_03 obj_07)
       (pred_6  obj_05 obj_07)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_05 obj_02)
       (pred_4 obj_01)
    )

    (:goal (and
       (pred_8 obj_11 obj_13)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_05 obj_16)
    ))
(:constraints
  (always (not (pred_4 obj_06)))
)
)

; plan
1. (op_3 obj_01 obj_03)
   deleted: (pred_8 obj_03 obj_01) (pred_1)
   added: (pred_12 obj_03)
   goals met: 0 of 3
2. (op_1 obj_01 obj_19)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_19)
   goals met: 0 of 3
3. (op_1 obj_19 obj_15)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_15)
   goals met: 0 of 3
4. (op_1 obj_15 obj_16)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_16)
   goals met: 0 of 3
5. (op_5 obj_16 obj_03)
   deleted: (pred_12 obj_03)
   added: (pred_1) (pred_8 obj_03 obj_16)
   goals met: 1 of 3
6. (op_1 obj_16 obj_17)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_17)
   goals met: 1 of 3
7. (op_3 obj_17 obj_11)
   deleted: (pred_8 obj_11 obj_17) (pred_1)
   added: (pred_12 obj_11)
   goals met: 1 of 3
8. (op_1 obj_17 obj_16)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_16)
   goals met: 1 of 3
9. (op_1 obj_16 obj_15)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_15)
   goals met: 1 of 3
10. (op_2 obj_15 obj_13 obj_11 obj_09)
   deleted: (pred_9 obj_13)
   added: (pred_7 obj_13)
   goals met: 1 of 3
11. (op_1 obj_15 obj_13)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_13)
   goals met: 1 of 3
12. (op_5 obj_13 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_1) (pred_8 obj_11 obj_13)
   goals met: 2 of 3
13. (op_1 obj_13 obj_15)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_15)
   goals met: 2 of 3
14. (op_1 obj_15 obj_16)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_16)
   goals met: 2 of 3
15. (op_1 obj_16 obj_17)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_17)
   goals met: 2 of 3
16. (op_1 obj_17 obj_20)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_20)
   goals met: 2 of 3
17. (op_1 obj_20 obj_04)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_04)
   goals met: 2 of 3
18. (op_1 obj_04 obj_12)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_12)
   goals met: 2 of 3
19. (op_1 obj_12 obj_02)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_02)
   goals met: 2 of 3
20. (op_3 obj_02 obj_05)
   deleted: (pred_8 obj_05 obj_02) (pred_1)
   added: (pred_12 obj_05)
   goals met: 2 of 3
21. (op_1 obj_02 obj_12)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_12)
   goals met: 2 of 3
22. (op_1 obj_12 obj_04)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_04)
   goals met: 2 of 3
23. (op_1 obj_04 obj_20)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_20)
   goals met: 2 of 3
24. (op_1 obj_20 obj_17)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_17)
   goals met: 2 of 3
25. (op_1 obj_17 obj_16)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_16)
   goals met: 2 of 3
26. (op_5 obj_16 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_1) (pred_8 obj_05 obj_16)
   goals met: 3 of 3
